Tekla Open API Reference for Tekla Structures 2025
PointList.LastIndexOf Method
Overload List
Name | Description
LastIndexOf(Point)
 Searches for the last occurence of the point in the list.
LastIndexOf(Point, Int32)
 Searches for the last occurence of the point in the list.
LastIndexOf(Point, Int32, Int32)
 Searches for the last occurence of the point in the list.
Top
See Also
Reference
PointList Class
Tekla.Structures.Drawing Namespace